---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsPipeFlowStateParam
source: html/496b3103-eed9-8143-3fff-f159fe45b791.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsPipeFlowStateParam Property

"Flow State"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsPipeFlowStateParam { get; }
```